## Day 4 - Assignment

#### Q1. How to import pandas and check the version?

In [1]:
import pandas as pd

print(pd.__version__)

1.1.3

#### Q2. How to create a series from a numpy array?

In [3]:
import numpy as np

arr = np.array(['a', 'b', 'c', 'd', 'e']) 
s = pd.Series(arr) 
print(s)

0    a
1    b
2    c
3    d
4    e
dtype: object

#### Q3. How to convert the index of a series into a column of a dataframe?

In [15]:
data_dict = {'Product': ['Computer','Printer','Monitor','Desk','Phone'],
              'Price'  : [1200,250,400,700,350]
            }
df = pd.DataFrame(data_dict)
df

    Product  Price
0  Computer   1200
1   Printer    250
2   Monitor    400
3      Desk    700
4     Phone    350

In [16]:
df.reset_index(inplace=True)
df = df.rename(columns = {'index':'S No.'})
df

   S No.   Product  Price
0      0  Computer   1200
1      1   Printer    250
2      2   Monitor    400
3      3      Desk    700
4      4     Phone    350

#### Q4. Write the code to list all the datasets available in seaborn library.

In [24]:
import seaborn as sns

sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'exercise',
 'flights',
 'fmri',
 'gammas',
 'geyser',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'tips',
 'titanic']

In [26]:
mpg = sns.load_dataset('mpg')
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

#### Q5. Which country origin cars are a part of this dataset?

In [47]:
[i for i in mpg.origin.unique()]

['usa', 'japan', 'europe']

#### Q6. Extract the part of the dataframe which contains cars belonging to 'usa'

In [39]:
df = mpg.where(mpg.origin=='usa').dropna(subset=['origin'])
df

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8.0,307.0,130.0,3504.0,12.0,70.0,usa,chevrolet chevelle malibu
1,15.0,8.0,350.0,165.0,3693.0,11.5,70.0,usa,buick skylark 320
2,18.0,8.0,318.0,150.0,3436.0,11.0,70.0,usa,plymouth satellite
3,16.0,8.0,304.0,150.0,3433.0,12.0,70.0,usa,amc rebel sst
4,17.0,8.0,302.0,140.0,3449.0,10.5,70.0,usa,ford torino
...,...,...,...,...,...,...,...,...,...
392,27.0,4.0,151.0,90.0,2950.0,17.3,82.0,usa,chevrolet camaro
393,27.0,4.0,140.0,86.0,2790.0,15.6,82.0,usa,ford mustang gl
395,32.0,4.0,135.0,84.0,2295.0,11.6,82.0,usa,dodge rampage
396,28.0,4.0,120.0,79.0,2625.0,18.6,82.0,usa,ford ranger
397,31.0,4.0,119.0,82.0,2720.0,19.4,82.0,usa,chevy s-10

In [43]:
df.count()

mpg             249
cylinders       249
displacement    249
horsepower      245
weight          249
acceleration    249
model_year      249
origin          249
name            249
dtype: int64